local localBlessData = {
    "多谢老板，老板新年好运！",
    "抓到真土豪，大家快来围观！",
    "多谢老板打赏，攒起来翻本",
    "土豪，我们可以做朋友吗？",
    "土豪，我要给你生猴子！",
    "祝你鸡年大吉！",
    "这个发红包的人好帅",
    "新年快乐，再发一个！",
    "红包红包，放进腰包",
    "谢谢打赏，祝你好人走好运！",
    "发红包的人，财运享通！",
    "红包已领，带走我吧。",
    "活捉一只土豪，包养我吧。",
    "红包已收，有事您说话！",
    "我就喜欢和你这样的人做朋友！",
    "点点滴滴也是爱！依然爱你！",
    "我就静静的等待你下一个红包！",
    "土豪，再来一个金条包！",
    "这位发红包的朋友，我爱你！",
    "祝豪大大吉祥如意！",
    "求老板再赐个红包！",
    "最爱红包包，最爱发红包的人！",
    "年行好运，万事遂心愿!",
    "新年来临，时时刻刻幸福欢乐！",
    "身体健康，万事如意!",
    "新春伊始，恭喜发财！",
    "祝一切顺心如意!",
    "新年发大财行大运!",
    "事事顺心，岁岁平安!",
    "辞旧迎新，心想事成！",
    "新年新气象，好人走好运！",
    "新春大吉，大展宏图！",
    "吉祥富贵，连年有余！",
    "花开似锦，金玉满堂！",
    "福禄寿喜，四季平安!",
    "佳节如意，新春进喜！",
    "前途无量，财运亨通!",
    "和和美美，红红火火!",
    "前程似锦，事事如意！",
    "生活好，步步高！",
    "新年快乐，合家幸福！",
    "生活美满，吉祥如意！",
    "阖家欢乐，万事顺意！",
    "春节愉快，身体健康！",
    "年年财源广进，岁岁平安祥和！",
    "幸福美满，健康快乐！ ",
    "吉祥如意，甜蜜美满！",
    "财源广进，恭喜发财！",
    "恭贺新禧，万事大吉！",
    "吉星高照，财运亨通！",
}


local RedEnvelopBlessConfig =  class(GameData);

RedEnvelopBlessConfig.randomGetBlessMsg = function(self)
    local index = math.random(1,#localBlessData);
    return localBlessData[index]; 
end


return RedEnvelopBlessConfig