#-*-coding:utf8 -*-

'''
Created on 2014-11-3

@author: junmeng
'''
#===============================================================================
# isStr 判断是否为字符串
#===============================================================================
def isStr(param):
    return type(param) == str

#===============================================================================
# isEmpty 判断若是字符串是否为空
#===============================================================================
def isEmpty(param):
    if param is None:
        return True
    elif isStr(param):
        return len(param) == 0
    else:
        return False